[
  "You're the reason I believe in love.",
  "No matter what life brings, we’ll face it together.",
  "I believe in you, even when you don’t.",
  "You are strong, beautiful, and endlessly loved.",
  "One breakfast in bed — made with love (and coffee).",
  "If loving you was a crime, I’d plead guilty and serve life happily.",
  "I must be a snowflake, because I’ve fallen for you.",
  "I choose you, every single day, and I always will.",
  "You have the most beautiful laugh — it’s my favorite sound.",
  "You're the only person I’d share my fries with… maybe.",
  "You choose the movie tonight — even if it's a rom-com marathon.",
  "You’re the reason I look at my phone and smile like an idiot.",
  "Are you Wi-Fi? Because I’m feeling a connection.",
  "You are more than enough — just as you are.",
  "I am so proud to call you mine.",
  "Loving you is the most natural thing I’ve ever done.",
  "A surprise date — I plan, you relax.",
  "I love being yours. Every day. Always.",
  "I fall in love with you more every day — in new, unexpected ways.",
  "You're my better half — because you remember everything that slips my mind.",
  "You are my heart’s greatest joy.",
  "I'll do anything you want for 24 hours — no questions asked.",
  "I’m not great with words, but you make me want to write love letters.",
  "You are my today and all of my tomorrows.",
  "You're the reason I believe in ‘meant to be.’",
  "Every day with you is a gift I’ll never take for granted.",
  "Your eyes are the most beautiful I have ever seen. They sparkle in the sunlight. I could stare at them all day.",
  "Your smile is my favorite sight.",
  "You make me want to be the best version of myself.",
  "Marriage: where 'What do you want to eat?' becomes a daily riddle.",
  "Surprise lingerie night — my choice.",
  "Waking up next to you is the best part of every day.",
  "Let’s turn the bedroom into a five-star suite — champagne and all.",
  "You make my world brighter just by being in it.",
  "I'll recreate our first date, just for you.",
  "You're the peanut butter to my jelly — slightly nutty but perfectly sweet.",
  "You're not just my wife, you’re my best friend and soulmate.",
  "Unlimited compliments all day — no sarcasm, only sweetness.",
  "A romantic slow dance in the living room — even if there's no music playing.",
  "You make even ordinary moments feel magical.",
  "You're my person — my today, tomorrow, and always.",
  "Are you French? Because Eiffel for you.",
  "I'll go buy you whatever food you're craving — even if it's sushi at midnight.",
  "Every love story is special, but ours is my favorite.",
  "You're my favorite person to do nothing with — and we do it so well.",
  "I love you more than Reese's.",
  "Your hugs are my favorite place to be.",
  "Even in a thousand lifetimes, I’d find you and love you all over again.",
  "You control the TV remote all day. I surrender.",
  "A hand-written love letter delivered tonight.",
  "My favorite place in the world is next to you.",
  "I'll whisper sweet nothings to you... for as long as you want.",
  "If I had a dollar for every time I smiled at you, I’d be a millionaire — and still buying you coffee.",
  "You're the reason I believe in love.",
  "Your smile still gives me butterflies.",
  "I love you even when you're hangry. That’s real love.",
  "You are worthy of all the love I have to give — and more.",
  "You're the best part of my life’s story.",
  "You're the reason I believe in ‘meant to be.’",
  "Dessert of your choice, handmade by me (or honestly, store-bought but plated with flair).",
  "They say marriage is a workshop… where I work and you shop.",
  "I still fall for you every single day.",
  "You're the best part of my life’s story.",
  "Behind every great man is a wife rolling her eyes.",
  "Today is a shopping day, and yes, I’ll carry your bags and smile.",
  "I would watch the office with you just to be with you.",
  "You're the only person I’d share my fries with… maybe.",
  "You’re my greatest adventure and my favorite home.",
  "Home is wherever I’m with you.",
  "You make this world a better place just by being in it.",
  "I love you more than you could ever know. My love for you continues to grow everyday. I never knew you could feel this much love towards someone.",
  "You’re my favorite notification.",
  "You get a full body massage, no time limit, no complaints.",
  "Private dinner date at home — candles, soft music, and me dressed to impress.",
  "I'll do anything you want for 24 hours — no questions asked.",
  "One day where I take over all chores — you're officially off duty.",
  "One ‘I won’t argue’ day pass — enjoy it wisely.",
  "Just when I think I couldn’t love you more, you prove me wrong.",
  "With you, every moment is a beautiful memory in the making.",
  "An uninterrupted nap while I handle everything.",
  "Tonight is about *you* — you choose how, when, and where.",
  "There’s no one else I’d rather share this life with.",
  "You're my better half — because you remember everything that slips my mind.",
  "Tonight, I’ll be your personal butler — attire optional.",
  "I’m grateful for your love every single day.",
  "If you see this, say yes to you for 24 hours. Anything you want.",
  "You get to make one fantasy request — and I *will* say yes.",
  "Your commitment to your family will forever inspire me.",
  "You're the peanut butter to my jelly — slightly nutty but perfectly sweet.",
  "I love you more than Reese's.",
  "I am so thankful God brought you into my life. I will forever pray and thank the Lord for you.",
  "Our time together continues to be the happiest moments of my life."
]
